In [50]:
import mysql.connector as connector
import pandas as pd

In [25]:
# 1 - Make a connection with MySQL:

try:

    connection = connector.connect(
        user = 'root',
        password = '******')

    print('Connected...')

except connector.Error as err: # If any error occurs, print the error code and the message

    print('Error code: ', err.errno)
    print('Error message: ', err.msg)

Connected...

In [26]:
# 2 - Create a Cursor:

if connection.is_connected():
    cursor = connection.cursor(buffered=True)
    print('Cursor ready...')
else:
    print('It was not possible to create cursor as connection was not previously established...')

Cursor ready...

In [4]:
# 3 - Create database meta_py_to_mysql:

cursor.execute("""DROP DATABASE IF EXISTS meta_py_to_mysql""") # OBS: the triple quoted string is used because now you can type a quote again in the middle of the string.

create_database_query = """CREATE DATABASE meta_py_to_mysql""" # Make a query to create a new database.
cursor.execute(create_database_query) # execute the create database query using the cursor to pass the 'create_database_query'

cursor.execute("SHOW DATABASES") # list all databases
for database in cursor:
    print(database)

('brin',)
('comercio',)
('information_schema',)
('lucky_shrub_my2',)
('meta_automobile',)
('meta_jewelrystore_db1',)
('meta_little_lemon',)
('meta_littlelemon_db2',)
('meta_lucky_shrub',)
('meta_lucky_shrub_my',)
('meta_lucky_shrub_my2',)
('meta_lucky_shrub_my3',)
('meta_lucky_shrub_my4',)
('meta_luckyshrub_db2',)
('meta_luckyshrub_db3',)
('meta_luckyshrub_db4',)
('meta_mangata_gallo',)
('meta_normalization',)
('meta_py_to_mysql',)
('meta_restaurant',)
('mydb',)
('mysql',)
('performance_schema',)
('puc_projeto',)
('sakila',)
('sys',)
('teste',)
('teste2',)
('world',)

In [28]:
# 4 - Use the created database:

use_database_query = "USE meta_py_to_mysql"
cursor.execute(use_database_query)

print('Your Database is: ', connection.database ) # confirm the name of the database in use

Your Database is:  meta_py_to_mysql

In [6]:
# 5 - Creating table menu_items:

cursor.execute("""DROP TABLE IF EXISTS menu_items""")

create_menuitem_table="""
CREATE TABLE menu_items(
itemID INT AUTO_INCREMENT,
name VARCHAR(200),
type VARCHAR(100),
price INT,
PRIMARY KEY(itemID)
)
"""

cursor.execute(create_menuitem_table)

cursor.execute('SHOW TABLES') # check all tables in database
for table in cursor:
    print(table)

('menu_items',)

In [7]:
# 5.1 Insert data into menu_items table:

insert_menu_items="""
INSERT INTO menu_items (itemID, name, type, price)
VALUES
(1,'Olives','Starters',5),
(2,'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10,'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

cursor.execute(insert_menu_items)
connection.commit() #  it is important to call this method after every transaction that modifies data

In [8]:
# 5.2 Fetch the data and the columns from the table:

show_menu_items = """SELECT * FROM menu_items""" # Create the query
cursor.execute(show_menu_items) # Execute the query

data_menu_items = cursor.fetchall() # Fetch all returned data
columns_menu_items = cursor.column_names # Return all the column names

In [9]:
# 5.3 Create the menu_items DataFrame using the data and the column names stored in variables:

df_menu_items = pd.DataFrame(data_menu_items, columns=columns_menu_items)
df_menu_items

    itemID               name          type  price
0        1             Olives      Starters      5
1        2          Flatbread      Starters      5
2        3         Minestrone      Starters      8
3        4       Tomato bread      Starters      8
4        5            Falafel      Starters      7
5        6             Hummus      Starters      5
6        7        Greek salad  Main Courses     15
7        8          Bean soup  Main Courses     12
8        9              Pizza  Main Courses     15
9       10      Greek yoghurt      Desserts      7
10      11          Ice cream      Desserts      6
11      12         Cheesecake      Desserts      4
12      13  Athens White wine        Drinks     25
13      14     Corfu Red Wine        Drinks     30
14      15     Turkish Coffee        Drinks     10
15      16     Turkish Coffee        Drinks     10
16      17             Kabasa  Main Courses     17

In [10]:
# 6 - Creating table menus:

cursor.execute("""DROP TABLE IF EXISTS menus""")

create_menu_table = """
CREATE TABLE menus (
menuID INT,
itemID INT,
cuisine VARCHAR(100),
PRIMARY KEY (menuID,itemID), 
FOREIGN KEY (itemID) REFERENCES menu_items(itemID)
);"""

# "PRIMARY KEY (menuID,itemID)" is composite primary key.

cursor.execute(create_menu_table)

cursor.execute("SHOW TABLES")
for table in cursor:
    print(table)

('menu_items',)
('menus',)

In [11]:
# 6.1 Insert data into menus table:

insert_menus="""
INSERT INTO menus (menuID, itemID, cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

cursor.execute(insert_menus)
connection.commit()

In [12]:
# 6.2 Fetch the data and the columns from the table:

show_menus = """SELECT * FROM menus"""
cursor.execute(show_menus)

data_menus = cursor.fetchall()
columns_menus = cursor.column_names

In [13]:
# 6.3 Create a DataFrame with variables:

df_menus = pd.DataFrame(data_menus, columns=columns_menus)
df_menus

    menuID  itemID  cuisine
0        1       1    Greek
1        1       7    Greek
2        1      10    Greek
3        1      13    Greek
4        2       3  Italian
5        2       9  Italian
6        2      12  Italian
7        2      15  Italian
8        3       5  Turkish
9        3      11  Turkish
10       3      16  Turkish
11       3      17  Turkish

In [14]:
# 7 - Create table bookings:

cursor.execute("""DROP TABLE IF EXISTS bookings""")

create_booking_table = """
CREATE TABLE bookings (
bookingID INT AUTO_INCREMENT,
tableNo INT,
guestFirstName VARCHAR(100) NOT NULL,
guestLastName VARCHAR(100) NOT NULL,
bookingSlot TIME NOT NULL,
employeeID INT,
PRIMARY KEY (bookingID)
);"""

cursor.execute(create_booking_table)

cursor.execute("SHOW TABLES")
for table in cursor:
    print(table)

('bookings',)
('menu_items',)
('menus',)

In [15]:
# 7.1 Populating the bookings table:

insert_bookings= """
INSERT INTO bookings (bookingID, tableNo, guestFirstName, guestLastName, bookingSlot, employeeID) 
VALUES
(1, 12,'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5); """

cursor.execute(insert_bookings)
connection.commit()

In [16]:
# 7.2 Fetch the data and the columns from the table:

cursor.execute("""SELECT * FROM bookings""")

data_bookings = cursor.fetchall()
columns_bookings = cursor.column_names

In [17]:
# 7.3 Create a DataFrame with variables:

df_bookings = pd.DataFrame(data=data_bookings, columns=columns_bookings)
df_bookings

   bookingID  tableNo guestFirstName guestLastName     bookingSlot  employeeID
0          1       12           Anna       Iversen 0 days 19:00:00           1
1          2       12         Joakim       Iversen 0 days 19:00:00           1
2          3       19        Vanessa      McCarthy 0 days 15:00:00           3
3          4       15         Marcos        Romero 0 days 17:30:00           4
4          5        5         Hiroki        Yamane 0 days 18:30:00           2
5          6        8          Diana         Pinto 0 days 20:00:00           5

In [18]:
# 8 - Create table orders:

cursor.execute("""DROP TABLE IF EXISTS orders""")

create_orders_table = """
CREATE TABLE orders (
orderID INT,
tableNo INT,
menuID INT,
bookingID INT,
billAmount INT,
quantity INT,
PRIMARY KEY (orderID),
FOREIGN KEY (menuID) REFERENCES menus(menuID)
);"""

cursor.execute(create_orders_table)

cursor.execute("SHOW TABLES")
result = cursor.fetchall()
print(result)

[('bookings',), ('menu_items',), ('menus',), ('orders',)]

In [19]:
# 8.1 Populating the orders table:

insert_orders="""
INSERT INTO orders (orderID, tableNo, menuID, bookingID, billAmount, quantity)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

cursor.execute(insert_orders)
connection.commit()

In [20]:
# 8.2 Fetch the data and the columns from the table:

cursor.execute("""SELECT * FROM orders""")

data_orders = cursor.fetchall()
columns_orders = cursor.column_names

In [21]:
# 8.3 Create a DataFrame with variables:

df_orders = pd.DataFrame(data=data_orders, columns=columns_orders)
df_orders

   orderID  tableNo  menuID  bookingID  billAmount  quantity
0        1       12       1          1           2        86
1        2       19       2          2           1        37
2        3       15       2          3           1        37
3        4        5       3          4           1        40
4        5        8       1          5           1        43

In [22]:
# X close the connection:

if connection.is_connected():
    cursor.close()
    connection.close()
    print('connection closed.')
else:
    print('connection is already closed.')

connection closed.